In [1]:
import mysql.connector
import pandas as pd
import numpy as np
from datetime import datetime, timedelta
import Water_Monitoring as wt

mydb = mysql.connector.connect(
  host="10.10.110.2",
  user="test",
  passwd="test"
  database="water_monetering"
)

print(mydb)

DatabaseError: 1130: Host '10.10.65.58' is not allowed to connect to this MySQL server

In [392]:
# cursor.execute("create database watertank_monitoring")

In [393]:
cursor = mydb.cursor()

In [394]:
cursor.execute("show tables")
for x in cursor:
    print(x)

('acc',)
('acc1',)
('acc_picam',)
('accident',)
('db',)
('iotcloud',)
('iotgui',)
('rand',)
('student',)
('tank',)
('test',)

In [395]:
df = pd.read_sql_query("select * from tank",mydb)
df = pd.DataFrame(df)
df.head()

   s_no  volume_in_ltrs  distance                time
0     1         7185.58      0.37 2019-09-17 13:43:55
1     2         7099.25      0.36 2019-09-17 13:43:57
2     3         7099.25      0.36 2019-09-17 13:44:00
3     4         7082.65      0.36 2019-09-17 13:44:02
4     5         7095.93      0.36 2019-09-17 13:44:05

In [396]:
df.rename(columns = {"time":"Time"}, inplace=True)
df.head()

   s_no  volume_in_ltrs  distance                Time
0     1         7185.58      0.37 2019-09-17 13:43:55
1     2         7099.25      0.36 2019-09-17 13:43:57
2     3         7099.25      0.36 2019-09-17 13:44:00
3     4         7082.65      0.36 2019-09-17 13:44:02
4     5         7095.93      0.36 2019-09-17 13:44:05

In [397]:
df["Date"] = df["Time"]
df.head()

   s_no  volume_in_ltrs  distance                Time                Date
0     1         7185.58      0.37 2019-09-17 13:43:55 2019-09-17 13:43:55
1     2         7099.25      0.36 2019-09-17 13:43:57 2019-09-17 13:43:57
2     3         7099.25      0.36 2019-09-17 13:44:00 2019-09-17 13:44:00
3     4         7082.65      0.36 2019-09-17 13:44:02 2019-09-17 13:44:02
4     5         7095.93      0.36 2019-09-17 13:44:05 2019-09-17 13:44:05

In [398]:
df.Date = pd.to_datetime(df.Date)

In [399]:
df.Date = df.Date.map(lambda t: t.strftime('%y-%m-%d'))
df.head()

   s_no  volume_in_ltrs  distance                Time      Date
0     1         7185.58      0.37 2019-09-17 13:43:55  19-09-17
1     2         7099.25      0.36 2019-09-17 13:43:57  19-09-17
2     3         7099.25      0.36 2019-09-17 13:44:00  19-09-17
3     4         7082.65      0.36 2019-09-17 13:44:02  19-09-17
4     5         7095.93      0.36 2019-09-17 13:44:05  19-09-17

In [400]:
df.Time = pd.to_datetime(df.Time)
df.Time = df.Time.map(lambda t: t.strftime('%H:%M'))
df.head()

   s_no  volume_in_ltrs  distance   Time      Date
0     1         7185.58      0.37  13:43  19-09-17
1     2         7099.25      0.36  13:43  19-09-17
2     3         7099.25      0.36  13:44  19-09-17
3     4         7082.65      0.36  13:44  19-09-17
4     5         7095.93      0.36  13:44  19-09-17

In [401]:
time = datetime.now()
end_time = time.strftime("%H:%M")

In [402]:
time = datetime.now() - timedelta(hours=1)
start_time = time.strftime("%H:%M")

In [420]:
print(start_time, end_time)

14:06 15:06

In [404]:
date = datetime.today().strftime('%y-%m-%d')
print(date)

19-09-17

In [405]:
#date1 = pd.to_datetime('13-08-19').strftime('%y-%m-%d')
df_date = df[df["Date"]==date]
df_date

     s_no  volume_in_ltrs  distance   Time      Date
0       1         7185.58      0.37  13:43  19-09-17
1       2         7099.25      0.36  13:43  19-09-17
2       3         7099.25      0.36  13:44  19-09-17
3       4         7082.65      0.36  13:44  19-09-17
4       5         7095.93      0.36  13:44  19-09-17
..    ...             ...       ...    ...       ...
105   106        31781.90      1.63  14:13  19-09-17
106   107        31599.30      1.62  14:13  19-09-17
107   108        31898.10      1.63  14:13  19-09-17
108   109        31509.60      1.61  14:13  19-09-17
109   110        31742.00      1.63  14:13  19-09-17

[110 rows x 5 columns]

In [408]:
#start_time = pd.to_datetime('18:18').strftime('%H:%M')
#end_time = pd.to_datetime('18:19').strftime('%H:%M')
df_time = df_date[df_date["Time"]>=start_time]
df_time = df_time[df_time["Time"]<=end_time]
df_time.tail()

     s_no  volume_in_ltrs  distance   Time      Date
105   106         31781.9      1.63  14:13  19-09-17
106   107         31599.3      1.62  14:13  19-09-17
107   108         31898.1      1.63  14:13  19-09-17
108   109         31509.6      1.61  14:13  19-09-17
109   110         31742.0      1.63  14:13  19-09-17

In [421]:
checking_time1 = pd.to_datetime('08:00').strftime('%H:%M')
checking_time2 = pd.to_datetime('09:00').strftime('%H:%M')
checking_time3 = pd.to_datetime('10:00').strftime('%H:%M')
checking_time4 = pd.to_datetime('11:00').strftime('%H:%M')
checking_time5 = pd.to_datetime('12:00').strftime('%H:%M')
checking_time6 = pd.to_datetime('13:00').strftime('%H:%M')
checking_time7 = pd.to_datetime('14:00').strftime('%H:%M')
checking_time8 = pd.to_datetime('15:00').strftime('%H:%M')
checking_time9 = pd.to_datetime('16:00').strftime('%H:%M')
checking_time10 = pd.to_datetime('17:00').strftime('%H:%M')

In [422]:
if start_time >= checking_time1 and end_time <= checking_time2:
    df_time.to_csv('/home/mythienbabu/Downloads/TankData1.csv')

In [423]:
if start_time >= checking_time2 and end_time <= checking_time3:
    df_time.to_csv('/home/mythienbabu/Downloads/TankData2.csv')

In [424]:
if start_time >= checking_time3 and end_time <= checking_time4:
    df_time.to_csv('/home/mythienbabu/Downloads/TankData3.csv')

In [425]:
if start_time >= checking_time4 and end_time <= checking_time5:
    df_time.to_csv('/home/mythienbabu/Downloads/TankData4.csv')

In [426]:
if start_time >= checking_time5 and end_time <= checking_time6:
    df_time.to_csv('/home/mythienbabu/Downloads/TankData5.csv')

In [427]:
if start_time >= checking_time6 and end_time <= checking_time7:
    df_time.to_csv('/home/mythienbabu/Downloads/TankData6.csv')

In [428]:
if start_time >= checking_time7 and end_time <= checking_time8:
    df_time.to_csv('/home/mythienbabu/Downloads/TankData7.csv')

In [429]:
if start_time >= checking_time8 and end_time <= checking_time9:
    df_time.to_csv('/home/mythienbabu/Downloads/TankData8.csv')

In [430]:
if start_time >= checking_time9 and end_time <= checking_time10:
    df_time.to_csv('/home/mythienbabu/Downloads/TankData9.csv')

In [ ]:
if start_time == checking_time1:
    dirt = r'C:\Users\mythi\Downloads\WaterTank Data'
    for files in os.listdir(dirt):
        os.remove(dirt+'/'+files)
                           
wt.main()